---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
source: html/c7f1efd1-635e-6f2b-63d7-5240a0e917df.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile

Defines parameters for Z Profile structural section.

## Syntax (C#)
```csharp
public class StructuralSectionZProfile : StructuralSectionGeneralLZ
```